{
  "architectures": [
    "Qwen3MoeForCausalLM"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "decoder_sparse_step": 1,
  "eos_token_id": 151645,
  "head_dim": 128,
  "hidden_act": "silu",
  "hidden_size": 2048,
  "initializer_range": 0.02,
  "intermediate_size": 5472,
  "max_position_embeddings": 262144,
  "max_window_layers": 28,
  "mlp_only_layers": [],
  "model_type": "qwen3_moe",
  "moe_intermediate_size": 768,
  "norm_topk_prob": true,
  "num_attention_heads": 32,
  "num_experts": 128,
  "num_experts_per_tok": 8,
  "num_hidden_layers": 48,
  "num_key_value_heads": 4,
  "output_router_logits": false,
  "qkv_bias": false,
  "quantization_config": {
    "autoround_version": "0.6.1.dev",
    "bits": 4,
    "data_type": "int",
    "extra_config": {
      "model.layers.0.mlp.gate": {
        "bits": 16
      },
      "model.layers.1.mlp.gate": {
        "bits": 16
      },
      "model.layers.10.mlp.gate": {
        "bits": 16
      },
      "model.layers.11.mlp.gate": {
        "bits": 16
      },
      "model.layers.12.mlp.gate": {
        "bits": 16
      },
      "model.layers.13.mlp.gate": {
        "bits": 16
      },
      "model.layers.14.mlp.gate": {
        "bits": 16
      },
      "model.layers.15.mlp.gate": {
        "bits": 16
      },
      "model.layers.16.mlp.gate": {
        "bits": 16
      },
      "model.layers.17.mlp.gate": {
        "bits": 16
      },
      "model.layers.18.mlp.gate": {
        "bits": 16
      },
      "model.layers.19.mlp.gate": {
        "bits": 16
      },
      "model.layers.2.mlp.gate": {
        "bits": 16
      },
      "model.layers.20.mlp.gate": {
        "bits": 16
      },
      "model.layers.21.mlp.gate": {
        "bits": 16
      },
      "model.layers.22.mlp.gate": {
        "bits": 16
      },
      "model.layers.23.mlp.gate": {
        "bits": 16
      },
      "model.layers.24.mlp.gate": {
        "bits": 16
      },
      "model.layers.25.mlp.gate": {
        "bits": 16
      },
      "model.layers.26.mlp.gate": {
        "bits": 16
      },
      "model.layers.27.mlp.gate": {
        "bits": 16
      },
      "model.layers.28.mlp.gate": {
        "bits": 16
      },
      "model.layers.29.mlp.gate": {
        "bits": 16
      },
      "model.layers.3.mlp.gate": {
        "bits": 16
      },
      "model.layers.30.mlp.gate": {
        "bits": 16
      },
      "model.layers.31.mlp.gate": {
        "bits": 16
      },
      "model.layers.32.mlp.gate": {
        "bits": 16
      },
      "model.layers.33.mlp.gate": {
        "bits": 16
      },
      "model.layers.34.mlp.gate": {
        "bits": 16
      },
      "model.layers.35.mlp.gate": {
        "bits": 16
      },
      "model.layers.36.mlp.gate": {
        "bits": 16
      },
      "model.layers.37.mlp.gate": {
        "bits": 16
      },
      "model.layers.38.mlp.gate": {
        "bits": 16
      },
      "model.layers.39.mlp.gate": {
        "bits": 16
      },
      "model.layers.4.mlp.gate": {
        "bits": 16
      },
      "model.layers.40.mlp.gate": {
        "bits": 16
      },
      "model.layers.41.mlp.gate": {
        "bits": 16
      },
      "model.layers.42.mlp.gate": {
        "bits": 16
      },
      "model.layers.43.mlp.gate": {
        "bits": 16
      },
      "model.layers.44.mlp.gate": {
        "bits": 16
      },
      "model.layers.45.mlp.gate": {
        "bits": 16
      },
      "model.layers.46.mlp.gate": {
        "bits": 16
      },
      "model.layers.47.mlp.gate": {
        "bits": 16
      },
      "model.layers.5.mlp.gate": {
        "bits": 16
      },
      "model.layers.6.mlp.gate": {
        "bits": 16
      },
      "model.layers.7.mlp.gate": {
        "bits": 16
      },
      "model.layers.8.mlp.gate": {
        "bits": 16
      },
      "model.layers.9.mlp.gate": {
        "bits": 16
      }
    },
    "group_size": 128,
    "nsamples": 512,
    "packing_format": "auto_round:auto_gptq",
    "quant_method": "auto-round",
    "sym": true
  },
  "rms_norm_eps": 1e-06,
  "rope_scaling": null,
  "rope_theta": 10000000,
  "router_aux_loss_coef": 0.0,
  "shared_expert_intermediate_size": 0,
  "sliding_window": null,
  "tie_word_embeddings": false,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.54.0",
  "use_cache": true,
  "use_qk_norm": true,
  "use_sliding_window": false,
  "vocab_size": 151936
}
